package Seminar_6;

// Задание №3

// 1. Реализуйте 1 из вариантов класса Cat из предыдущего задания, можно 
// использовать не все придуманные поля и методы.
// Создайте несколько 
// экземпляров этого класса, выведите их в консоль.

// 2. Добейтесь того, чтобы при выводе в консоль 
// объекта типа Cat, выводилась 
// его кличка, цвет и возраст 
// (или другие параметры на ваше усмотрение).

// Задание №4

// 1. Создайте множество, в котором будут храниться экземпляры 
// класса Cat - HashSet<Cat>.
// Поместите в него некоторое количество объектов.

// 2. Создайте 2 или более котов с одинаковыми параметрами в полях. 
// Поместите их во множество.
// Убедитесь, что все они сохранились во множество.

// 3. Создайте метод public boolean equals(Object o)
// Пропишите в нём логику сравнения котов по параметрам, 
// хранимым в полях. То есть, метод должен возвращать true, 
// только если значения во всех полях сравниваемых объектов равны.

// 4. Создайте метод public int hashCode()
// который будет возвращать hash, вычисленный на основе полей класса Cat. 
// (Можно использовать Objects.hash(...))

// 5. Выведите снова содержимое множества из пункта 2, 
// убедитесь, что дубликаты удалились.

import java.util.Arrays;
import java.util.HashSet;
import java.util.Set;

public class MainCat {
    public static void main(String[] args) {
        // Создадим Экземпляры Классов 3-х котов
        Cat cat1 = new Cat("Tom", "black", 3);
        Cat cat2 = new Cat("Felix", "white", 2);
        Cat cat3 = new Cat("Murka", "gray", 1);
        Cat cat4 = new Cat("Felix", "white", 2);
        Cat cat5 = new Cat("Murka", "gray", 1);

        // System.out.println(cat1);
        // System.out.println(cat2);
        // System.out.println(cat3);

        Set<Cat> cats = new HashSet<>(Arrays.asList(cat1, cat2, cat3, cat4, cat5));

        for (Cat cat : cats) {
            System.out.println(cat);
        }

        // equal - переопределили, но ...
        // Вывел всех (5) - с дубликатами. 
        //-----------------------------------------
        // Имя: Felix; Окрас: white; Возраст: 2
        // Имя: Murka; Окрас: gray; Возраст: 1
        // Имя: Felix; Окрас: white; Возраст: 2
        // Имя: Tom; Окрас: black; Возраст: 3
        // Имя: Murka; Окрас: gray; Возраст: 1
        //------------------------------------------
        // Нужно переопределить еще и hash-код, который отличается (см. Cat.java)
        // см. п.4. Задачи
        // Переопределяем: Objects.hash(name, color, age);
        //----------------------------------------
        // Имя: Felix; Окрас: white; Возраст: 2
        // Имя: Murka; Окрас: gray; Возраст: 1
        // Имя: Felix; Окрас: white; Возраст: 2

    }
}




    


