
// Задание №2
// 1. Продумайте структуру класса Кот. Какие поля и методы будут актуальны для 
// приложения, которое является
// а) информационной системой ветеринарной клиники
// б) архивом выставки котов
// в) информационной системой Театра кошек Ю. Д. Куклачёва
// Можно записать в текстовом виде, не обязательно реализовывать в java.

// А. Ветеринарная клиника

// Поля
//    1)  Кличка (name)
//    2)  Порода (breed)
//    3)  Возраст (age)
//    4)  окрас (color)
//    5)  хозяин (owner)
//    6)  Вакцинация (vaccination) (arrayList)
//    7)  История болезней (medecalHictory)

// методы
//     1) Получить кличку
//     2) Получить породу
//     3) ...

//     8) add прививку
//        ... 



// Б. Выставка котов    

// Поля
//    1)  Кличка (name)
//    2)  Порода (breed)
//    3)  Возраст (age)
//    4)  окрас (color)
//    5)  хозяин (owner)
//    6)  Вакцинация (vaccination) (arrayList)
//    7)  Награды (rewards)
//    8)  Родители/Родословная (parants)

// методы
//     добавить
//     получить
//     add награду
//     set кличку и проч.
//     ... 


// В. Театр кошек

// Поля:
//    1)  Кличка (name)
//    2)  Порода (breed)
//    3)  Возраст (age)
//    4)  окрас (color)
//        тренер
//    5)  навык/роли/номера ()
//    6)  Вакцинация (vaccination) (arrayList)
//    7)  Награды (rewards)
//    8)  Родители/Родословная (parants)

// методы:
//     добавить
//     получить
//     add выступления, навыки
//     set кличку и проч.
//     ... 

